Repository: sheilagomes/wp-trad
Catalog: tm/PHP_en-pt_BR.tmx
Source language: en
Languages: pt_br

source: function odd( $var) {return ($var% 2 == 1);} function even($var) {return ($var% 2 == 0);} $array1 = array ("a"= 1, "b"= 2, "c"= 3, "d"= 4, "e"= 5); $array2 = array (6, 7, 8, 9, 10, 11, 12); echo "Odd :\n"; print_r(array_filter($array1, "odd")); echo "Even:\n"; print_r(array_filter($array2, "even"));
pt_br: function impar( $var) {return ($var% 2 == 1);} function par($var) {return ($var% 2 == 0);} $array1 = array ("a "= 1, "b" = 2, "c "= 3, "d" = 4, "e "= 5); $array2 = array (6, 7, 8, 9, 10, 11, 12); echo "Impares: \n"; print_r(array_filter($array1, "impar")); echo "Pares: \n"; print_r(array_filter($array2, "par"));

source: The printout of the program above will be:
pt_br: A saída deste programa seria:

source: Odd:
pt_br: Impares:

source: Array ([a] = 1 [c] = 3 [e] = 5) Even:
pt_br: Array ([a] = 1 [c] = 3 [e] = 5) Pares:

source: Users may not change the array itself from the callback function. e.g.
pt_br: As funções utilizadas por array_filter() não devem alterar os valores do array..

source: Add / delete an element, unset the array that array_filter() is applied to.
pt_br: Por exemplo, adicionar ou remover um elemento, pode apagar o array ao qual está sendo aplicada array_filter().

source: If the array is changed, the behavior of this function is undefined.
pt_br: Se este array for alterado, o comportamento desta função se torna imprevisvel.

source: See also array_map() and array_reduce().
pt_br: Veja também array_map() e array_reduce().

source: array_flip() returns an array in flip order, i.e. keys from trans become values and trans's values become keys.
pt_br: array_flip() retorna um array com com a relação entre suas chaves e valores invertida, ou seja, as chaves de trans passam a ser os valores e os valores de trans passam a ser as chaves.

source: Note that the values of trans need to be valid keys, i.e. they need to be either integer or string.
pt_br: Note que os valores de trans devem ser chaves válidas, ou seja, eles precisam ser inteiros não negativos ou string.

source: A warning will be emitted if a value has the wrong type, and the key / value pair in question will not be flipped.
pt_br: Um aviso será mostrado se um valor é de um tipo inválido para chaves, e o par chave / valor em questão não será invertido.

source: If a value has several occurrences, the latest key will be used as its values, and all others will be lost.
pt_br: Se um valor tem várias ocorrências, a última chave será usada como valor, e todos os outros serão perdidos.

source: array_flip() returns FALSE if it fails.
pt_br: array_flip() retorna FALSE se falhar.

source: Example 1. array_flip() example
pt_br: Exemplo de array_flip()

source: Example 2. array_flip() example: collision
pt_br: Exemplo de array_flip(): colisão

source: now $trans is:
pt_br: Agora $trans é:

source: Returns an array of the parameters.
pt_br: Retorna um array a partir dos valores fornecidos.

source: The parameters can be given an index with the = operator.
pt_br: Índices podem ser atribuidos aos valores através do operador =.

source: Syntax "index = values", separated by commas, define index and values. index may be of type string or numeric.
pt_br: O índice por de ser do tipo string ou numérico.

source: When index is omitted, a integer index is automatically generated, starting at 0.
pt_br: Quando o índice é omitido, um índice numérico inteiro é automaticamente gerado, começando do 0.

source: If index is an integer, next generated index will be the biggest integer index + 1.
pt_br: Se o índice é um inteiro, o próximo índice a ser gerado será igual ao maior índice inteiro + 1.

source: Note that when two identical index are defined, the last overwrite the first.
pt_br: Note que quando dois índices idênticos são definidos, o último sobrescreve o primeiro.

source: The following example demonstrates how to create a two-dimensional array, how to specify keys for associative arrays, and how to skip-and-continue numeric indices in normal arrays.
pt_br: O exemplo a seguir demonstra como criar um array com duas dimensões, como especificar chaves em arrays associativos, e como definir índices numéricos em arrays normais.

source: Example 1. array() example
pt_br: Exemplo de array()

source: $fruits = array ("fruits "= array ("a"= "orange", "b"= "banana", "c"= "apple"), "numbers" = array (1, 2, 3, 4, 5, 6), "holes "= array ("first", 5 = "second", "third"));
pt_br: $frutas = array ("frutas "= array ("a"= "laranja", "b"= "banana", "c"= "melancia"), "numeros" = array (1, 2, 3, 4, 5, 6), "buracos "= array ("primeiro", 5 = "segundo", "terceiro"));

source: Automatic index with array()
pt_br: Indexação automática com array()

source: will display:
pt_br: vai mostrar:

source: This example creates a 1-based array.
pt_br: Esse exemplo cria um array com o índices a partir do 1.

source: 1-based index with array()
pt_br: Array com índices a partir do 1 com array()

source: $firstquarter = array( 1 = 'January', 'February', 'March'); print_r($firstquarter);
pt_br: $trimestre = array( 1 = 'Janeiro', 'Fevereiro', 'Marco'); print_r($trimestre);

source: Array ([1] = 'January '[2] = 'February' [3] = 'March ')
pt_br: Array ([1] = 'Janeiro '[2] = 'Fevereiro' [3] = 'Marco ')

source: See also array_pad(), list(), and range().
pt_br: Veja também array_pad(), list() e range().

source: Example 1. array_intersect_assoc() example
pt_br: Exemplo 1. array_intersect_assoc() example

source: array_intersect() returns an array containing all the values of array1 that are present in all the arguments.
pt_br: array_intersect() retorna um array contendo todos os valores de array1 que estão presentes nos outros argumentos.

source: Example 1. array_intersect() example
pt_br: Exemplo de array_intersect()

source: $array1 = array ("a "= "green", "red", "blue"); $array2 = array ("b" = "green", "yellow", "red"); $result = array_intersect ($array1, $array2);
pt_br: $array1 = array ("a "= "verde", "vermelho", "azul"); $array2 = array ("b" = "verde", "amarelo", "vermelho"); $result = array_intersect ($array1, $array2);

source: This makes $result have
pt_br: Isso faz com que $result tenha

source: Array ([a] = green [0] = red)
pt_br: Array ([a] = verde [0] = vermelho)

source: See also array_intersect_assoc(), array_diff(), array_diff_assoc().
pt_br: Veja também array_diff().

source: array_key_exists() returns TRUE if the given key is set in the array. key can be any value possible for an array index.
pt_br: array_key_exists() retorna TRUE se a chave key existe no array. key pode ser qualquer valor possível para uma chave de array.

source: Example 1. array_key_exists() example
pt_br: Exemplo de array_key_exists()

source: $search_array = array( "first "= 1, "second" = 4); if (array_key_exists("first", $search_array)) {echo "The'first 'element is in the array";}
pt_br: $busca_array = array( "primeiro "= 1, "segundo" = 4); if (array_key_exists("primeiro", $busca_array)) {echo "O elemento 'primeiro 'está no array !";}

source: The name of this function is key_exists() in PHP version 4.0.6.
pt_br: O nome dessa função é key_exists() no PHP versão 4.0.6.

source: See also isset().
pt_br: Veja também isset().

source: array_keys() returns the keys, numeric and string, from the input array.
pt_br: array_keys() retorna as chaves, numéricas e string, do array input.

source: If the optional search_value is specified, then only the keys for that value are returned.
pt_br: Se o parâmetro opcional search_value for especificado, então apenas as chaves para esse valor serão retornadas.

source: Otherwise, all the keys from the input are returned.
pt_br: Do contrário, todas as chaves de input serão retornadas.

source: Example 1. array_keys() example
pt_br: Exemplo de array_keys()

source: $array = array (0 = 100, "color "= "red"); print_r(array_keys ($array)); $array = array ("blue", "red", "green", "blue", "blue"); print_r(array_keys ($array, "blue")); $array = array ("color" = array("blue", "red", "green"), "size "= array("small", "medium", "large")); print_r(array_keys ($array));
pt_br: $array = array (0 = 100, "cor "= "vermelho"); print_r(array_keys ($array)); $array = array ("azul", "vermelho", "verde", "azul", "azul"); print_r(array_keys ($array, "azul")); $array = array ("cor" = array("azul", "vermelho", "verde"), "tamanho "= array("pequeno", "medio", "grande")); print_r(array_keys ($array));

source: Array ([0] = 0 [1] = color) Array ([0] = 0 [1] = 3 [2] = 4) Array ([0] = color [1] = size)
pt_br: Array ([0] = 0 [1] = cor) Array ([0] = 0 [1] = 3 [2] = 4) Array ([0] = cor [1] = tamanho)

source: This function was added to PHP 4, below is an implementation for those still using PHP 3.
pt_br: Abaixo está uma implementação para aqueles que ainda usam PHP 3.

source: Implementation of array_keys() for PHP 3 users
pt_br: Implementação de array_keys() para usuários do PHP 3

source: See also array_values().
pt_br: Veja também array_values().

source: array_map() returns an array containing all the elements of arr1 after applying the callback function to each one.
pt_br: array_map() retorna um array contendo todos os elementos de arr1 depois de aplicada uma determinada função em cada um.

source: The number of parameters that the callback function accepts should match the number of arrays passed to the array_map()
pt_br: O número de parâmetros que esta função aceita deve coincidir com o número de arrays passados para a array_map()

source: Example 1. array_map() example
pt_br: Exemplo de array_map()

source: ?php function cube( $n) {return $n*$n*$n;} $a = array(1, 2, 3, 4, 5); $b = array_map("cube", $a); print_r($b);?
pt_br: ?php function cubo( $n) {return $n*$n*$n;} $a = array(1, 2, 3, 4, 5); $b = array_map("cubo", $a); print_r($b);?

source: This makes $b have:
pt_br: E programa acima faz com que $b tenha:

source: Example 2. array_map() - using more arrays
pt_br: Exemplo 2. array_map() - usando mais de um array

source: ?php function show_Spanish( $n, $m) {return "The number $n is called $m in Spanish";} function map_Spanish($n, $m) {return array ($n = $m);} $a = array(1, 2, 3, 4, 5); $b = array("uno", "dos", "tres", "cuatro", "cinco"); $c = array_map("show_Spanish", $a, $b); print_r($c); $d = array_map("map_Spanish", $a, $b); print_r($d);?
pt_br: ?php function mostrar_Espanhol( $n, $m) {return "O número $n é chamado de $m na Espanha";} function map_Espanhol($n, $m) {return array ($n = $m);} $a = array(1, 2, 3, 4, 5); $b = array("uno", "dos", "tres", "cuatro", "cinco"); $c = array_map("mostrar_Espanhol", $a, $b); print_r($c); $d = array_map("map_Espanhol", $a, $b); print_r($d);?

source: This results:
pt_br: Resultará em:

source: / / printout of $c Array ([0] = The number 1 is called uno in Spanish [1] = The number 2 is called dos in Spanish [2] = The number 3 is called tres in Spanish [3] = The number 4 is called cuatro in Spanish [4] = The number 5 is called cinco in Spanish) / / printout of $d Array ([0] = Array ([1] = uno) [1] = Array ([2] = dos) [2] = Array ([3] = tres) [3] = Array ([4] = cuatro) [4] = Array ([5] = cinco))
pt_br: / / Saída de $c Array ([0] = O número 1 é chamado de uno na Espanha [1] = O número 2 é chamado de dos na Espanha [2] = O número 3 é chamado de tres na Espanha [3] = O número 4 é chamado de cuatro na Espanha [4] = O número 5 é chamado de cinco na Espanha) / / Saída de $d Array ([0] = Array ([1] = uno) [1] = Array ([2] = dos) [2] = Array ([3] = tres) [3] = Array ([4] = cuatro) [4] = Array ([5] = cinco))

source: Usually when using two or more arrays, they should be of equal length because the callback function is applied in parallel to the corresponding elements.
pt_br: Normalmente quando se usa dois ou mais arrays, eles devem ter o mesmo tamanho porque a função callback é aplicada paralelamente nos elementos correpondentes.

source: If the arrays are of unequal length, the shortest one will be extended with empty elements.
pt_br: Se os arrays tem tamanhos diferentes, o menor array será extendido com elementos vazios.

source: An interesting use of this function is to construct an array of arrays, which can be easily performed by using NULL as the name of the callback function
pt_br: Uma forma interessante de se usar esta função é na construção de um array de arrays, o que pode ser facilmente feito usando NULL como o nome da função callback.

source: Creating an array of arrays
pt_br: Criando um array de arrays

source: ?php $a = array( 1, 2, 3, 4, 5); $b = array("one", "two", "three", "four", "five"); $c = array("uno", "dos", "tres", "cuatro", "cinco"); $d = array_map(null, $a, $b, $c); print_r($d);?
pt_br: ?php $a = array( 1, 2, 3, 4, 5); $b = array("um", "dois", "tres", "quatro", "cinco"); $c = array("uno", "dos", "tres", "cuatro", "cinco"); $d = array_map(null, $a, $b, $c); print_r($d);?

source: See also array_filter(), array_reduce(), and array_walk().
pt_br: Veja também array_filter(), array_reduce() e array_walk().

source: array_merge() merges the elements of two or more arrays together so that the values of one are appended to the end of the previous one.
pt_br: array_merge() funde os elementos dois ou mais arrays de forma que os elementos de um são colocados no final do array anterior.

source: It returns the resulting array.
pt_br: Retorna o array resultante da fusão.

source: If the input arrays have the same string keys, then the later value for that key will overwrite the previous one.
pt_br: Se os arrays dados têm as mesmas chaves string, então o último valor para uma chave irá sobrescrever o valor anterior.

source: If, however, the arrays contain numeric keys, the later value will not overwrite the original value, but will be appended.
pt_br: Se, no entanto, os arrays tem as mesmas chaves numéricas, o último valor para uma chave não sobrescreverá o valor original, e sim adicionado ao array resultante.

source: Example 1. array_merge() example
pt_br: Exemplo de array_merge()

source: $array1 = array ("color "= "red", 2, 4); $array2 = array ("a", "b", "color" = "green", "shape "= "trapezoid", 4); $result = array_merge ($array1, $array2);
pt_br: $array1 = array ("cor "= "vermelho", 2, 4); $array2 = array ("a", "b", "cor" = "verde", "forma "= "trapezoide", 4); $result = array_merge ($array1, $array2);

source: The $result will be:
pt_br: Neste caso $result será:

source: Array ([color] = green [0] = 2 [1] = 4 [2] = a [3] = b [shape] = trapezoid [4] = 4)
pt_br: Array ([cor] = verde [0] = 2 [1] = 4 [2] = a [3] = b [forma] = trapezoide [4] = 4)

source: Simple array_merge() example
pt_br: Exemplo simples de array_merge()

source: Don 't forget that numeric keys will be renumbered!
pt_br: Não esqueça que as chaves numéricas serão reordenadas!

source: If you want to completely preserve the arrays and just want to append them to each other, use the + operator:
pt_br: Se você quer preservar os arrays e apenas concatená-los, o operador +:

source: Shared keys will be overwritten on a first-come first-served basis.
pt_br: Chaves coincidentes serão sobrescritas usando as regras de primeira ocorrência.

source: See also array_merge_recursive().
pt_br: Veja também array_merge_recursive().

source: array_merge_recursive() merges the elements of two or more arrays together so that the values of one are appended to the end of the previous one.
pt_br: array_merge_recursive() funde os elementos de dois ou mais arrays de forma que os elementos de um são colocados no final do array anterior.

source: If the input arrays have the same string keys, then the values for these keys are merged together into an array, and this is done recursively, so that if one of the values is an array itself, the function will merge it with a corresponding entry in another array too.
pt_br: Se os arrays dados tem as mesmas chaves string, então os valores para uma chave são fundidos em um array, e isso é feito recursivamente, sendo que, se um dos valores for um array também, este função irá fundi-lo com os valores correspondentes no array resultante também.

source: If, however, the arrays have the same numeric key, the later value will not overwrite the original value, but will be appended.
pt_br: Se, no entanto, os arrays tem as mesmas chaves numéricas, o último valor para uma chave não sobrescreverá o valor original, e sim adicionado ao array resultante.

source: Example 1. array_merge_recursive() example
pt_br: Exemplo de array_merge_recursive()

source: $ar1 = array ("color "= array ("favorite" = "red"), 5); $ar2 = array (10, "color "= array ("favorite" = "green", "blue")); $result = array_merge_recursive ($ar1, $ar2);
pt_br: $ar1 = array ("cor "= array ("favorita" = "vermelho"), 5); $ar2 = array (10, "cor "= array ("favorita" = "verde", "azul")); $result = array_merge_recursive ($ar1, $ar2);

source: Array ([color] = Array ([favorite] = Array ([0] = red [1] = green) [0] = blue) [0] = 5 [1] = 10)
pt_br: Array ([color] = Array ([favorita] = Array ([0] = vermelho [1] = verde) [0] = azul) [0] = 5 [1] = 10)

source: See also array_merge().
pt_br: Veja também array_merge().

source: array_multisort() can be used to sort several arrays at once or a multi-dimensional array according by one of more dimensions.
pt_br: array_multisort() pode ser usada para ordenar vários arrays de uma vez ou apenas um array multi-dimensional de acordo com uma das dimensões.

source: It maintains key association when sorting.
pt_br: A associação entre chaves e valores é mantida.

source: The input arrays are treated as columns of a table to be sorted by rows - this resembles the functionality of SQL ORDER BY clause.
pt_br: Os arrays dados são tratados como colunas de uma tabela a ser classificada pelas linhas - isso lembra a funcionalidade da cláusula ORDER BY da SQL.

source: The first array is the primary one to sort by.
pt_br: O primeiro array é o principal na ordenação.

source: The rows (values) in that array that compare the same are sorted by the next input array, and so on.
pt_br: As linhas (valores) no primeiro array serve de base para a ordenação do próximo, e assim por diante.

source: The argument structure of this function is a bit unusual, but flexible.
pt_br: A estrutura de argumentos dessa função não é muito normal, mas bastante flexível.

source: The very first argument has to be an array.
pt_br: O primeiro argumento de todos deve ser um array.

source: Subsequently, each argument can be either an array or a sorting flag from the following lists.
pt_br: Subsequentemente, cada argumento pode ser um array ou um dos sinais de classificação da lista a seguir.

source: Sorting order flags:
pt_br: Sinais de ordem de classificação:

source: SORT_ASC - sort in ascending order
pt_br: SORT_ASC - classifica na ordem crescente

source: SORT_DESC - sort in descending order
pt_br: SORT_DESC - classifica na ordem descrescente

source: Sorting type flags:
pt_br: Sinais de tipos de ordenação:

source: SORT_REGULAR - compare items normally
pt_br: SORT_REGULAR - compara os elementos normalmente

source: SORT_NUMERIC - compare items numerically
pt_br: SORT_NUMERIC - compara os elementos como itens numéricos

source: SORT_STRING - compare items as strings
pt_br: SORT_STRING - compara os elementos como strings

source: No two sorting flags of the same type can be specified after each array.
pt_br: Não podem existir dois sinais de ordenação do mesmo tipo especificados para um mesmo array.

source: The sorting flags specified after an array argument apply only to that array - they are reset to default SORT_ASC and SORT_REGULAR before each new array argument.
pt_br: Os sinais de ordenação especificados depois de um array se aplicam apenas para esse array - a eles são atribuídos por padrão os valores SORT_ASC e SORT_REGULAR depois de cada novo argumento do tipo array.

source: Sorting multiple arrays
pt_br: Ordenando múltiplos arrays

source: In this example, after sorting, the first array will contain 10, "a", 100, 100.
pt_br: Nesse exemplo, depois da ordenação, o primeiro array terá 10, "a", 100, 100.

source: The second array will contain 1, 1, "2", 3.
pt_br: O segundo conterá 1, 1, "2", 3.

source: The entries in the second array corresponding to the identical entries in the first array (100 and 100) were sorted as well.
pt_br: Os elementos do segundo array que correpondem aos do primeiro (100 e 100) também foram ordenados.

source: Sorting multi-dimensional array
pt_br: Ordenando um array multi-dimensional

source: In this example, after sorting, the first array will contain 10, 100, 100, "a" (it was sorted as strings in ascending order), and the second one will contain 1, 3, "2", 1 (sorted as numbers, in descending order).
pt_br: Nesse exemplo, depois da ordenação, o primeiro array terá 10, 100, 100, "a" (foi ordenado como strings em ordem crescente), e o segundo conterá 1, 3, "2", 1 (classificado como números, em ordem descrescente).

source: array_pad() returns a copy of the input padded to size specified by pad_size with value pad_value.
pt_br: array_pad() retorna uma cópia de input expandido para o comprimento especificado por pad_size com o valor pad_value.

source: If pad_size is positive then the array is padded on the right, if it 's negative then on the left.
pt_br: Se pad_size for positivo então o array é expandido pela direita, se for negativo, pela esquerda.

source: If the absolute value of pad_size is less than or equal to the length of the input then no padding takes place.
pt_br: Se o valor absoluto de pad_size for menor ou igual ao comprimento de input, então ele permanece inalterado.

source: Example 1. array_pad() example
pt_br: Exemplo de array_pad()

source: $input = array (12, 10, 9); $result = array_pad ($input, 5, 0); / / result is array (12, 10, 9, 0, 0) $result = array_pad ($input, -7, -1); / / result is array (-1, -1, -1, -1, 12, 10, 9) $result = array_pad ($input, 2, "noop"); / / not padded
pt_br: $input = array (12, 10, 9); $result = array_pad ($input, 5, 0); / / $result é array (12, 10, 9, 0, 0) $result = array_pad ($input, -7, -1); / / $result é array (-1, -1, -1, -1, 12, 10, 9) $result = array_pad ($input, 2, "noop"); / / Não será expandido

source: array_pop() pops and returns the last value of the array, shortening the array by one element.
pt_br: array_pop() retira e retorna o último elemento de array, diminuindo array em um elemento.

source: If array is empty (or is not an array), NULL will be returned.
pt_br: Se array estiver vazio (ou se não for um array), o valor NULL é retornado.

source: Example 1. array_pop() example
pt_br: Exemplo de array_pop()

source: $stack = array ("orange", "banana", "apple", "raspberry"); $fruit = array_pop ($stack);
pt_br: $cesta = array ("laranja", "banana", "melancia", "morango"); $fruta = array_pop ($cesta);

source: After this, $stack will have only 3 elements:
pt_br: Depois disso, $cesta terá 3 elementos:

source: Array ([0] = orange [1] = banana [2] = apple)
pt_br: Array ([0] = laranja [1] = banana [2] = melancia)

source: This function may return Boolean FALSE, but may also return a non-Boolean value which evaluates to FALSE, such as 0 or "".
pt_br: Esta função pode retornar o booleano FALSE, mas também pode retornar um valor não-booleano que pode ser avaliado como FALSE, como 0 ou "".

source: Please read the section on Booleans for more information.
pt_br: Leia a seção em Booleanos para maiores informações.

source: Use the === operator for testing the return value of this function.
pt_br: Utilize o operador === para testar o valor retornado por esta função.

source: See also array_push(), array_shift(), and array_unshift().
pt_br: Veja também array_push(), array_shift(), e array_unshift().

source: array_push() treats array as a stack, and pushes the passed variables onto the end of array.
pt_br: array_push() trata array como uma pilha, e adiciona as variáveis passadas como argumentos no final de array.
